package com.example.springboot;

import com.example.springboot.bean.OutputObject;
import org.apache.commons.collections.MapUtils;

import java.io.*;
import java.util.Arrays;
import java.util.HashMap;

/**
 * Created by ZhangPei on 2018/12/1.
 */
public class TestClass {
    public static void main(String[] args) throws IOException {
        String s = "éå®c ççÊ";
        String s1 = new String(s.getBytes(), "ISO-8859-1");
        String s2 = new String(s.getBytes(), "UTF-8");
        System.out.println(s2);
        String s3 = "{\n" +
                "    \"object\":null,\n" +
                "    \"rtnCode\":\"0\",\n" +
                "    \"rtnMsg\":\"成功\",\n" +
                "    \"sn\":\"\",\n" +
                "    \"bean\":{\n" +
                "        \"total\":\"5\"\n" +
                "    },\n" +
                "    \"beans\":[\n" +
                "        {\n" +
                "            \"username\":\"zhangpei\"\n" +
                "        },\n" +
                "        {\n" +
                "            \"age\":\"22\"\n" +
                "        }\n" +
                "    ]\n" +
                "}";
        HashMap<String, Object> map = new HashMap<>();
        boolean isInterface = MapUtils.getBooleanValue(map, "isInterface");
        System.out.println(isInterface);

        String s4 = new String("张佩".getBytes(), "ISO-8859-1");
        System.out.println(s4);

        String s5 = new String(s4.getBytes(), "utf-8");
        System.out.println(s5);


        String s6 = "\"\u0089PNG\n" +
                "\u001A\n" +
                "\n" +
                "IHDR\u0003\u008EW\b\u0006K.\u001Bî IDATx\u0001í\u009D\u0007x\u0015E\u0017\u0086¿\u0014\u0092Ð\u009Bô\u008Eô\"½(\u001D\u0001©¢\b\u0082\u0080H\u0011+*\"\u001D\u0004Ei*Ò\u0004DéUzïMzï½×PCï!$ÿó\u009D\u009B¹Ù{¹In ñ\u0007ræy\u0092Ý;;;»ûÎìÌ\u009C3gÎzø_¸\u0014\u0002\u0081\u0081\u0081\u0098¿d\u00192gÌ\u0088²¥J2Ê\u001Eö\u001F<\u008C-Ûwàöí;(T ?Ê¼áxÜ\u009EÐ²sôø\t,_µ\u001A¥J\u0096°Ä:î®Û¸\t\u0095+\u0096GöW³:\u001C\u0018ò×(Ôªþ\u00162¦O\u0087cÇO`ÕÚ\n" +
                "¨÷n\u00AD°4!ÀÄ©3P£Z\u0015dÎ\u0090\u001Eû\u000F\u001DÆº\u008D\u009Bñi³&ö4wïÝÃ¢%Ëqþâ%<~ü\u0018©R¥Dñ¢\u0085\u0091-Kf\u0004\u0004\\Å¸ÉSÑ°~]¤N\u0099BÎ9uö\u001CfÎ\u009E\u0087\u008F\u009B}\u0088D\t\u0012àÔ\u0099³rÿ·nÝ\u0086\u0087\u0087\u0007Ò¤N\u0085j\u0095ßDâÄ\u0089$}HH\bx\u009FiÓ¤F\u009D·kHÜî}\u0007°bÕj¼]£*²eÍb¿\u0097\u001B7obÁâe¸tù\u008A=.e\u008AWPµRE¼òJr\u0089\u000B\n" +
                "\n" +
                "Â\u008AUkpèè1¹_\u001F\u001F\u001F\u0094(V\u0018Å\n" +
                "\u0017\u0092ãSfÌFÂ\u0004\tPý\u00ADJö<\u0086\u008F\u001E\u0087\u0002yó dñ¢8sö\u001CÖ¬ß\u0088+\u0001Wáíí\u008DtiÓ bÙÒH\u0092$±¤ß¶c\u00176mÝ.åìåå\u0089\u001CÙ³¡r\u0085r\u0092Ö\u0099\u0007ïwáÒ\u0015¸xñ\u0092<;ïµL©×¥<\u001E>|\u0088\u0091ã&\"cÆ\f¨ùVe·Xò\u009C)3æ àêU\u0014-\\Hê×\u0080!ÃQ±|\u0019¼\u00967\u008FÜß²U«qéÒe4nPO~ó\u001EF\u008D\u009B\u0084zuj#Cº´\u00186b\f\u008A\u0014*\u0080âEl<\u008E\u009F<\u0085¹\u000B\u0016£H¡\u0082OÔW; 7vÈeó¶\u001Døò\u0093æöÔk7lÂ\u0091cÇÑ¢I#\\\u000E¸\u008A\t\u0093§¢|ÙÒØ²u;îÝ¿\u000F\u0096M¹Òo \u007FÞÜösøî\u001C=z\\êI\u0083ºïÚãÝÙ\u0099·x)XÏ\u001A½ÿ\u009E=ù\u009Eý\u0007°k÷>aÆHÖ»êU*IþöD\u0096\u001DÖ\u007F¾\u0007Öw`îÂÅRçø\u001C\u009E\u009E\u009E\u0096Ô¶]>çÎ]{\u0010ôø±DÄ\u0089\u0013GêR±Â\u0005å÷ÃÀGX¼t9ÈÚ\u0084\u0084\t\u0012¢ò\u009Bå\u00909c\u0006\u0089\"\u009F%ËVH½3iR§N\u0085\u001AU+#qÂ\u0084\u0012uôøIlß¹\u000B\u0017.^\u0002ß\u001B///\u0014.ø\u009AC;²kï>°,È\u0081\u0081yÔ®Q\n" +
                "ñãÅ5Ùbß\u0081CXùï\u001AûýæÈ\u0091\u001DÕ+W´?Ûýû\u000F°`É2ø\u009F¿ ï\u0010ß\u0083²¥ß@ÁüyíyÜ\u007Fø\u0010³ç.\u0090{adÜ¸~¨U½*Ò§McO\u0013Ùuì\tuG\t(\u0001% \u0004\u0094\u0080\u0012P\u0002±\u0088\u0080G÷^¿\u008AàÈgN\u009281ªW\u00ADl\u0017¦\u00187}Ö\\\u009C;\u007F\u0001¹så@©\u0012Å\u0091 A|·ðPp¤°D¡#¼@!\u0087\u0082Pd\u0082ã\u009A\n" +
                "\u009BÐüÃ\u0086\u0092\n" +
                "\u0007±ë7m\u0011\u0081¥y\u0093\u0086rÏ¼\u008E§\u0097§\bvÎ×¢Ð\u0018\u0018\u0014\u0084¸¾¾Î\u0087ÜúýàÁ\u0003\u0019èrPý¬\u0081y]½~C\u0004Ó\u0084\t\u0013¸Ì.88\u0018wïßGÂøîqvÎ\u0084\u0003c\u001Foo¹gçcü}ûî]Ä\u008F\u001B×>Øv\u0095ÆÄQ\u0099À@AÉ\u001Ax\u008F®\u0004\u0011k\u001AWû\u008F\u001E=\u0012A\u0095\u0082xt\u0004\n" +
                "¤¾\u0096r=vâ$®^»þDÖ7oÝBâD6\u0081ßz\u0090eZ¸@~kT¤ûwïÞCüøñ\\¦{ôø1(\u009EQ0\u008A®pãÆM\u0090w²dI£+K\u0087|X&×nÜà\u0081äI\u0093Hù8$@\u0081\u008C\u0082¼\u008F¯/\u0092&Nä²ì)ð±nQé\u0012^Ý\u0096|nÝB²¤Iáëãú}ºzõ\u001Aüâú!~<×\u008C\u001F?\u000EF@@\u0080\bÒ~~~Î·*¿Yo¯ß¼\u0085\u0014É\u0093¹¼W&¢\u0012\u008CïJÊPÅ\u008DsFî\\Çù\u001Cý\u00AD\u0004\u0094\u0080\u0012P\u0002J@\t(\u0081\u0097\u0099\u0080Ç\u0095«×ì\u0082£³\u0080À\u0007÷¿pQ\u0004\n" +
                "3så.\f\u000ExÏøûÛg\u0094\\\u009D·{ß~dÎ\u0090Á>\u008BgÒ\u001C8|\u0004Y3e\u0082\u009F\u009F¯Ì@\u009C¿t\t¹²g\u0093Ã\u001C|\u009E>wN\u0006\u009FfÐ÷ç\u008812#\u0094+\u0087-\u008DÉG·±\u008BÀ\u008EÝ{e\u0086Ùù©ïÜ¹\u008D\u0004\tl³_Öcq}}ðfù²Ö(ÝW\u0002J@\t(\u0001% \u0004\u0094\u0080\u0012P\u0002JÀ\u0005\u0001\u008F\u009B·ïØ\u0005G\u0017Ç_\u0088¨;wîÊ,PtÍd½\u0010\u000F\u00AD7©\u0004\u0094\u0080\u0012P\u0002J@\t(\u0001% \u0004\u0094\u0080\u0012ø\u008F\bxÿG×\u0089ÑË¸k>\u001B£7¡\u0099+\u0001% \u0004\u0094\u0080\u0012P\u0002J@\t(\u0001% \u0004^R\u0002OzÌxI\u001FT\u001FK\t(\u0001% \u0004\u0094\u0080\u0012P\u0002J@\t(\u0001% \u0004\u009E\u008E\u0080\n" +
                "\u008EOÇMÏR\u0002J@\t(\u0001% \u0004\u0094\u0080\u0012P\u0002J@\tÄ\u001A\u0002*8Æ\u009A¢Ö\u0007U\u0002J@\t(\u0001% \u0004\u0094\u0080\u0012P\u0002J@\t<\u001D\u0001\u0015\u001C\u009F\u008E\u009B\u009E¥\u0004\u0094\u0080\u0012P\u0002J@\t(\u0001% \u0004\u0094\u0080\u0012\u00885\u0004Tp\u008C5E\u00AD\u000Fª\u0004\u0094\u0080\u0012P\u0002J@\t(\u0001% \u0004\u0094\u0080\u0012x:\u0002\u001E!!!/üç8\u009EîÑõ,% \u0004\u0094\u0080\u0012P\u0002J@\t(\u0001% \u0004\u0094\u0080\u0012p\u0087\u0080Î8ºCIÓ(\u0001% \u0004\u0094\u0080\u0012P\u0002J@\t(\u0001% \u0004b1\u0001\u0015\u001Ccqáë£+\u0001% \u0004\u0094\u0080\u0012P\u0002J@\t(\u0001% \u0004Ü! \u0082£;\u00944\u008D\u0012P\u0002J@\t(\u0001% \u0004\u0094\u0080\u0012P\u0002J \u0016\u0013ð~üøñKûø\u001E\u001E\u001E0\u007F1ù\u0090ºL4zè²¬4(\u0001% \u0004\u0094\u0080\u0012P\u0002J@\t(\u0001%ðü\u0011ð~þn)úî\u0088\u0002\u009D\u0011ê(\u0094xzFï\u0004«É;úî8vçdxª\u0019»ë\u0081>½\u0012P\u0002J@\t(\u0001% \u0004\u0094ÀóGÀ#(((VyU\u008D\u000E\u0001Ò\b8Ï_q¾\\w¤\u0002äËU\u009Eú4J@\t(\u0001% \u0004\u0094\u0080\u0012P\u0002/.\u0081è\u009D\u0082{\u00018Pè{\u0016ó\\\u0015\u001Aÿ»BVÖÿ\u001Dk½\u0092\u0012P\u0002J@\t(\u0001% \u0004\u0094\u0080\u0012\u0088\u0088@¬\u0013\u001C\n" +
                "\u008C§\u0011\u001EU\u00901ôþ»\u00AD2ÿïXë\u0095\u0094\u0080\u0012P\u0002J@\t(\u0001% \u0004\u0094@x\u0004b\u00ADàH Q\u0011\u001EU\u0080\t¯\n" +
                "Å|¼²\u008FyÆz\u0005% \u0004\u0094\u0080\u0012P\u0002J@\t(\u0001%\u0010\u0011\u0081\u0097Ú9ND\u000Fn\u008E\u0005\u0007\u0007Gê4'<Á%äÂYÀÃ\u0013\u001E©Ó\u0099ì\\nC®\\\u001E\u0007G\u009AÎåÉ\u001A)\u0004X\u0006ºæñ%\u00AD\fÁÁ@ÿaÀÌ¥À¤?\u0080¸~À»\u001F\u00035+m[\u0001qb}3õÿ)x-\u0097ÿ\u000Fw½ê\u000BAàô3z\u0001Ï\u0014\u0012«ÜK¼\u0010eú<Þ$'8\u000E\u001D:\u0084K\u0097.áÑ£GâðÑ\u008C\u0085ÌØÔú\u009BûqâÄAªT©\u0090+W.xyy=\u008F\u008F¥÷ô\u0002\u0013xîGdÁ!!ð|Æ\u0006:¢ò1/^DiÂ;öxö$àÁ}x\u007Fó=à\u0019þËùø\u009FQÀ\u009D\u009BðîôKxYi|\f\u0013¨V\u00AD\u009AË+4jÔ\b\u008D\u001B7vy,&#U\u0010¶Ð\u009D¿\u0014h7È\u0016±}\u0017\u0010?>°ñ\u0090í/sFà\u0083:\u0096Äºû\u009F\u0011x\u000EË\u0085ýAHpp¬\u001D\fý?Ú±\u0017¹\u00ADz\u0091ïý?{ÏõBÏ5\u0001\n" +
                "\u008Dü\"@\u0089\u0012%àíí8d7ãW\n" +
                "\u008Bü3¿)l\u009E>}\u001A\u0007\u000F\u001ED¾|ù\u009EëçÓ\u009B{ñ\bxoÙºMî:s¦LH\u00992\u0005\u0016/]\u0086|yó }:×³h¬\u0098\u008B\u0096,Å\u008A\u0095+Ñ©C{¼\u0092<ù\u0013OÍ4\u0081\u0081\u0081\bzü\u0018\u008F\u0002\u001F!èq\u0090loÜ¼\u0081+\u0001Wqéâ%éøë¼[Û~.Ï\u00198d(>jÜ\bI\u0093$\u0091øë7nàç^½ñkß>1*<F4ëh^Dû\u008DZv\u0082'ý\u0005øÄ\u0005¾ýÁ\u0012ûänðìÉ¶È§\u0014\u001CïÝ»\u0087C\u0087\u008F<\u00991\u00804©S#M\u009AÔrìä©Sxø0Ðe:F¦K\u009B\u0006\t\u0013&|âø\u0083\u0007\u000F\u000F\u000Føùú:\u001C»xñ\"<=½¤^8\u001C\býqüÄ\t\u009C;ç\u008FreË8\u001C\u009E5g.\n" +
                "\u0016x\n" +
                "Y2gv\u0088g\u009DèÕ§/~èö½CüÝ{÷Ðë\u0097ßÐó\u0087n\u000EñÎ?X\u0016F³æ|Ì\u009Dß\u008B\u0016-rHÆAØòåË%îi\u0085Çó\u0017.`ÃÆM¨[ç]ÉÇÿüy©û\u000E\u0017\u0002\u00902eJÄ\u008F\u0017O¢Y\u009E?õì\u008B\u009E?ÿ õ\u009AÏÕ«Ï/øªÕ\u0017HäT>,÷G\u008FleÊgÏ\u00977¯äqóæMüÔ«\u000F¾ùêKdH\u009FÞárK\u0097-Çkùó!uêÔ8}æ,nß¾ípÜüÈ\u0099#;\u001E\u0007\u0007ãòåË&JÞK\u0096Óµk×íqÜI\u00952%Ò§wÝ&8$t÷Gp\b0ðOà³æÀ\u0091ãag\u001D<\u0006Äó\u000Bû}ø\u0018\u0010\u0014\u0004\f\u001C\u000E|ó)àÔq\u0086%\fÛc}Ú»w\u001FJ\u0014/\u0086+W\u0002pízØ³$O\u009E\f)^yE\u0012\u000F\u001Bþ7\u009A5m\"õþÒåËØ³w\u001F*U¬ðD\u001DëÛïw\u0094,^\u001C\u000FîßÇ[U*Û/t% ÀeY\u009B\u0004ìäÉ-¼ðÁ\u0087MÑóÇî\u000E\u0087Ù\u0006'H\u0090\u0001W¯âøñ\u0013\u000EÇÂûñê«Y]¶Ãá¥\u008F0>\u0006ËÅ\\\u0097í\n" +
                "Ë$OîÜ8çï\u008F]»v£f\u008Dêæp\u0084ÛÕ«×àþýû¨^\u00ADj¸é^Êr±<mL´c&û±ã'¢d\u0089bÈ\u0099#\u0087D±ý\u00981c&Ú|û\u008DI\"Û\u001B7nbÅªUxïÝwä÷ÑcÇ\u00916m\u001A\\½z\u0015;vìÄ;µßÆþ\u0003\u0007\u0091=Û«ðññ\u0091r>{î\u001C\n" +
                "\u0015(???Ì\u00989\u001B¾~¾¨P¾\u009CC¾qýüd\u0090|ùò\u00159§p¡\u0082¸{÷.öí?à\u0090Îú£HáBO\f¨y|÷\u009E=X·~#¾üüSkò\u0018ßç<\"¿H\u001C\u0007\u009EðñL\n" +
                "\u008FW\u0092!äÆ\u0003<\u000E<\u0086\u0087\u009E\u009E¢øp÷&öíß/õ=¢ôqãÆ\u0095~áQP\u0010öìÙ\u001BQRû±T©RÚÇx\u0007\u000E\u001E\u0004ËÓ\u0084\u0084\t\u0013àÂÅKR6ÿ®^\u0083òeËÈ\f\u00969~çÎ\u001Di+Íoë6Q¢\u0084ö>\u008AñìÛ8\u000E4\u0081³_Î\u0013\u0001\u0003\u0006ÿ\u0081Ï>iùÄøÃ\u009C³uÛ6iÇÃ{ç/^ºäÐ\u000EÇ\u008B\u0017\u000F§O\u009F1§Û·\u0005^ËïPOþük\u0004jÖ¨fç`Oø\u009Cí\u009C?\u007F\u001E¥J\u0095\u0002\u009F+¢±jPP\u0090ôßdîëë\u008BL\u00992aýúõn\t\u008EQ©g\u0006Ï\u009Aµë\u0090:u*äÈ\u009EÝDáØñãØ±s\u0017Þ¯û\u009E=ÎÕ\u000EËlÔØñèÜ¾\u00AD«ÃR\u001FoÝ¾e?\u0016?^|i\u000Fø\u008CÖðjÖ¬H\u0092$±5*Êû\u0093ÿ\u0099\u008AB\u0085\n" +
                "\"WN[\u009Bg\u001DG'M\u009AÄ¡\u000Fgß³ió\u0096p¯Q¸p!$N\u0094Èáø\u008BRÏ\u001Cn:\u0092\u001FÞ\u001E\u009E¶\u008F®\u009BI½Û·nãqPØ\u008Bn=\u009FÚÞ9sç\u0081\u008DzË\u0016-Ð½GOtëÒÑ\u0001,Ó³¡è×\u007F \u009CÊNcî\u0082\u0085¨Z¹\u0012òæÍ\u0083äÉ\u0092\u0089PñJ\n" +
                "ÛàÍä\u007Fòä)\\¾r\u0015I\u0012'Æ\u008A\u0095«ÀÎ\u009FáÀÁ#\u0018=f,âÇ\u008F/\u001DÎ;o×2§DÛ\u0096/ZTCÈ¹\u0093\b>{JN\u000B>~\u0010\u009E¯æv\u0099EÈE\u007F\u0084\u001C³uz\u0011¥³\u009EL\u0081lÁâ%ö¨âE\u008Aàö\u009D;òûäÉ\u0093¸té2J\u0096,!¿Y±M\u0018?a\u0012²dÉ\u0082\u0084\t\u0012\u0098(ûvËÖíhòaCäÊ\u0019&8r°ÌÁóºõ\u001B¤QªüfE¼U¥\u0092½!øwÍZéôë¼S\u001B\u0014v8°.Y¢¸=Ï\u0007\u000F\u001EÚ;\u001C\u000Et÷ï? B$\u0005\u000F6pÎ\u0081õçÈ±'\u0007Ã\u009CA¸sÛö|ÎçÄôï¾}û¢C\u0087\u000Er\u0099§\u0011\u001E·nÛ\u008EG\u0081\u0081v\u000E\u0014XnÝzRP+]ú\n" +
                "»à¸{Ï^äÉ\u0093\u000B\u0087-Ê\u0080D\u0089\u0012aÁ\u0082\u0085(X° Ü\u000B\u001Bþ¬Y2ãúõë2pà;5eÚ\f\u008C\u001C>T\u008EÏ\u009E;_:t\u0096yÇ\u000Eí\u001C:ãlÙ²áû\u001F\u007FÂ÷\u009D;\"  \u0014f\u00198H?{Æ\u001F¯¿n+ÃW³fÁÍ[·°rÕ¿\u0018?q2\u001AÖ¯\u0087D\u0089\u0013\u008BÐyçî]9\u0087ÿöíÛ\u008F|ùòF¯à¸t%ðÝ\u0080å^¼°ýZ8{\u001E°*0\n" +
                "ä\u0001\u0006ýe\u009B\u0091Ì\u009C\u0001xïí°´áìÅñöÆæ-[Àúíéá\tv@éÒ¤ÁY\u007F\u007F\u0011¦yZ¾<ypöüy\u0004\u0087\u000EjØîìß»\u001F·nÝÂ»ïÔvà\u0019ò8\u0018yrçÂ\u0084Éÿ\u0080\u001D\u0083\u0011<wîÚ\u008D3.\u0006(æ¶X¦ï×\u000B¿\u0003åìÈÑ£&¹lýâú\u0089àH\u008Dñ\u0083\u0087\u000F\u001D\u008EíÚµK\u00149¯½\u0096ß!\u009EïO´\u0085\u0018,\u0017s\u008F\u001B6m\u0096~¹!¦W\u0097¯ØÚzsÜº¥âdÓæÍö¨ë×®có¶í¸|å\u008A=\u008E;\n" +
                "Þ¯'ý\u0003÷_ÊrqxÚ'\u007F<K;Æ¾Ö\f´½½½0zü$Ô}Çö\u009EÍ\u009B¿@ú\u0094mÛwÈE3eÊ(õ\u009F\u0002ÂÂÅKQ£ZUá¾vÍ:¼Uµ²ø\n" +
                "¸s÷\u009E¤åX¡Õ\u0097\u009FK\u001FÂwáÆõ\u001B\u00183n\u0002Þx½$&M\u0099\u008AÒ¯\u0097Äè±ã\u0091/Oné÷\u0017/_\u0081\tcFJþñâÅÅ¢ÅKÀAsÁ\u0082\u00050gÁB¼[«\u0086ä»rÕjQJfÉ\u0092I~\u009BÞ{Û¶íøgÆ\f\u0089ã¿ À@lß±\u000B'N\u009FrP\u0006µøè#äÎ\u0095Ó\u009E.:wâ\"!\u0092\u000Eê\u0003Ï:µá\u00996í\u0093Yß¸\u008E3É\u009ET¶?\u0099Ð\u00163iêt\u0094}ãuÄ\n" +
                "U::§»\u007Fï\u001EÖlØ\u0088^?æ¥\u0094\u0006k»Í´gÎ\u009CÅþC\u0087Q\u00ADJ%\u0087S\u0093Z\u0014Ì·oß\u00912¢\u0002¹S×n\u00982i<\u0016.Z\u0082\u00AD[·\t{\u000EÖi\"IÁ\u0085\u0081\n" +
                "L??G%3ã\u0003®^ÃÚ\n" +
                "\u001B\u001C\u0004Ç\u0087\u000F\u001F¢rµ\u009A(^´\u0018\u0002®\u0005 EÓ\u008FP¶Li\u0087{¡\u0082ÁÚ\u0086õ\u001F0\b\u0007\u000E\u001F\u0086\u0087\u0087Í\u0005Ç½;wð8$\u0004³ç-°\u009FÇ\u0001|÷®\u009D\u0090íÕW±{÷\u001ElÜ´\u0019w\u001FÜGÞ\\¹P´HaG\u000E!!èÑ³7\u0096-\u009Ao?\u009Fc¾uëÖãÃÆ\n" +
                "íq\u009C4ùwízûïª\u0095*¢|¹²ößÿ¯\u001Dö\u0005\u009Cqd9\u0090=Çb|~*ûYæ\u0012<<¤Me91ðùx\u000EÏu'D©\u009E\u0085f\u00988qbQèX\u0005G\u008Eû\u0002\u0003m÷`½î²\u0015+1qò\u0014©g\u008C\u000F\t\tÆÅ\u008B\u0097ðÉ\u0017_Ù\u0093qÜØ°Áû¨RéM\u009Có?\u0087Uÿ®ÁæÍ[P©REä\f\u0015ê¬yÏ]°\u00AD[}ùÔ\u0082#\u0015Y\u00945æÎ_(\u008AZÎÐR1ÜoÀ p,\u001Cpå\n" +
                "\u0092'O.J0s\u0093÷\u001F<ÀÜùóñiË\u0096&Ê¾\u009D9k6²e{ÕAp|\u0091ê\u0099ýAÜØñ^²l\u0005²eÍ\u0082äÉ\u0092cøÈÑ8rè0¶íØ\u0081\u0084\u0089\u0012\u00896\u0080\u0095\u008F\u0081\u0095uúÌÙ²ý¸ySÑÜ|÷ÍWèöãOhÛú\u001BdÏ\u009EÍ~9\u000EÜ:wl/\u0095wõ\u009Aµ¢\u0089¬_¯.¨\u0011\u001B9j\fJ\u0097zÃ>«hNâK[ïÝÚ2¸åìLÚ´iÑ¦]Güþk\u001F\u009C8y\u0012\u00193d;\u009F\u0098\n" +
                ",`çÙ,Æ\u0085\u0017\u0082§\u008D\u0087\u0007Í¦h\u001E°b!\u0010\u008Eàøxòß\u0092\u0005Ó\u0005/\u009C\tÏ¯º\u0084\u0097¥=>]Ú´¨_÷=ÔoØ\u0004\u0013Æ\u008E\u0094Ù\u0004\n" +
                "#ì\u00148pJ\u0098 !¨iñòô\u0004;rk¨Qí-$K\u0096Ì\u001A%û\u008F\u0082\u001C_f\u0096gëïÚ£ÙG\u001F¢K§\u000EÒpSëÔõ\u0087\u009F0jøP\u0019¼²ÌL¸sç.\u0086\u000EÿÛAp4Ç¸e§süøqûìcpp\b8\u001Bwöì9\u0099ù±¦5û'N\u009C´Ï\u0096\u009A¸È¶®Ê)²s\":ÎuO;èbCÎw\u0082\u0002Ø\u0098\tMP\u00ADR%|Ð°>(P[\u0003;Y3óÄ\u0086uî¼\u0085ø¸ÅG8xè°=Y\u0096,¶ÙY*\n" +
                "\u0018(ÈPpdù\u0092SÑ×òcçîÝrìà¡CÒqÔ¬ÑH:\u0087\u007Fÿ]\u008D\u008A\u0015ÊÛóâyÝ»t\u0096Á5µñücà \u009CZø·kÚ\u0006`\u008C£¶\u009AÚAÆ·hÞLÒ\u0091ñê5ëÐ¢ÙG¢Ád\u009DseY \u0089\u009Fößò5¶3\u007F\u0018\u0001Lé\u000BäË\u0002ì;\tÜ¼\u0005øøØ\u008EeImë\u0018Û\u000E¶ý^¾Ö-Á\u0091Êª/>ÿ\f{÷î\u0085¿ÿ\u0005¼^¢\u00046oÝ\u008AbE\u008B\u0082\u009D\u0005\u0085CZAX\u0003\u0005õ/¿üL:\u0012\u000E(vìÚe?¼}×n\u0004\u008F\u0018%Zw\u000E°\u008DàÈ\u000E.*\u0081\u0083¨a\u007FÙÚ\u0003\u009EÇwúÐ\u00910K\u0082\u0012Å\u008A!m\u009A4\u0092%ëK²¤Ie°`®±ÿÀ\u0001\u0094-]JÞ}\u0013Çö\u0099÷\u001Em!\u0006Ë\u0085÷Èú?oá\"dË\u0092EÚõkW¯áÀá#2\u00062ÏÀ\u0099HÎ\u00163¤O\u0097\u0016\u0095*VÄÕkW1~ò?hýå\u0097¨W÷=©ÿ?þÔ\u0013}zý,é¸¦Ç\u0084\u0097²\\ÌÃ\u0085³}\u0096v\u008C\u0083Mc\u0095ÀúÇ?óÛ\f\u009CÍïÇAAbÅÐíÇ\u001E8uê\f\u009Aµü\fM\u001A} wµlù\n" +
                "ðøÁ£G\u0091p^\u0002\u001C9\u0016fI@K\u008AjUß\u0092÷\u008F\u008AÊ\u0001ý~\u0091~\u008CÂâG\u001F6\u0096>ëä\u0099³öv\u0086³îíÛ¶ÁÌÙsDy\u00969Cz¼òÊ+8vü\u0004ü/\\\u0014ÁñÆÍ[\"r¼Ápïþ}T®P\u0001¥K\u0097\u0092ß\u0014(>nÞ\u001C¦m\u0095H¾¦}1\u0011Ñ°å,ZÊÁC\u0010çóO\u009F\u0018G\u0084e\u001F\u0082\u0010\u007F\u009B\u0012/,.ò½7Þx],QØ\u000FÐ\n" +
                "Ë´çóæ/D¡B\u0005Dpd.|\u0007Ê\u0095)\u008D«W¯\u0081Ö]\f\u0001W\u0002\u00905S\u0006y\u008FøÛ\u0003\u001EÂÃ\u008CuX®\u0093§LA³\u008F\u009Aàè±sèÒ±½\u0094ÿÇ-\u009A¡mÇÎhÞô#ü6`\u0010ªU©,\u0002\u0019ó \u0012\u009Fán¨\u0082@~\u0084\u008E\u0001Ì¾u[´H!ôûµ·ÌÔÐRæ¯\u0011£¬\u0087E90jÌ8\u0094zãu\u0099Tà8ç\u0097Þ=¥\u000Fä}\u008E\u001E;\u000EµjÖ\u0090º±k÷\u001EÐ:\u008E\u0003þ\u0010ZG2ØçØ\u0092cDZÚ0P\u0018¥ÐÄßTÐ\u0015*\\PúJ\u001EãLÙÎ]»púìY\u008C\u0019;^ÒW©\\IêYã\u0006õ$\u007Fö\u0095\u0017.\\\u0094cÿï\u007FdÀv\u0093[\u008EÛê×¯\u008F\u0013'NHßmÆ¨\u008CoÚ´):wî\fö3\u008C7ç¸{ÿîÖ³[·oãÓ/¾\u0092{!Ûi3f¡v\u00AD\u001A¢¼ãµ\u0016,Z,3\u008FÜ/^´\u0088X\u0087\u0004=z\u0084ïZ\u007F\u0085¼yòH9¬^»\u000EÉ\u0093%\u0015%\u0003ûd\u008E¥\u0098\u0017-Ø\u0018hYÅúLk:cÍÅz½iË\u0016QV1ÍâÅË¤\u008EÈ\tOñïÆ\u008D\u001B¢\fùáû.r\u00ADù\u000B\u0016¢Ò\u009B\u0015Aë\u0089\u0001¿ý\"m\n" +
                "Í\u0084\u009DÃ\u0099³þX¸ÐÑz\u008Diö:YE¼hõÌù9#úíýYË\u0016\u0098=g\u001E\u001E>|\u0080\u0092Å\u008B!OÎ\u009Còò\u000E\u001F\u0015öró%\u001C0x\b\u008A\u0016.\u0084zïÕ\u0001MÁ\u0018\u0092¿\u0092\u001C_|ú\tºÿÔ\u0013Õ«V\u0011M½1Çc\u00037aÒdÑH4iÜ\u0010«V¯ÁêuëP½J\u0015ûËmn\u008CÓÖþ\u0017/É\u008Bß«o_1\u0081Ý¶c'¾iõ¹t\f4\u0011Û¾}\u0007\u009A~ô¡9%Ú·Q\u0015H\u0082\u0096Í\u0006\u0082Ù\u0010\u0087àñ´±ðúä»'ï)ø1\u0082W/³§\u000B\u009E;\u0005pCp¤)\u008FüÅõ\u0093\u0005Îì\u0018§Í\u0098\u0089À\u0087\u000F\u0091,yrÄA\u001Ciø&ý3\u00153¦Lr¸îº\n" +
                "\u001B\u001D4\u001Eæà¡C\u0087\u0091ßbë¾yËVøúúÈ\u008BbLG\n" +
                "\u0017*\u0084¯>ÿT\u0006\u0006yóä\u0006ÍTx\u001FÔ¢üðso\u009C:u\n" +
                "í:vÆç\u009F´\u0094A\u001F\u0007W¯_Gà£@¼^²\u0004îÝ\u007F\n" +
                ">\u009CI\u001B?q\u0012\n" +
                "\u0014,\u0088À\u0007\u000Fd\u0010¸~ÃF,\\º\fçÏ_À\u000F=~F\u0083úïcÑÒ¥ø ^]\u0011R\u001F=²5\u001C¼_j6\u008DÂÂÜ\u007FLm\u00ADk\u0086&N\u009C\u0018¥õ\u008E§Ï\u009CAÞÜ¹Ðê\u008BÏðc¯ÞhÝú+i0i\u009AP¬h\u0011¹å»wîàúõ\u001Bø®MkùM³Öu\u001BÖ£çOÝEX²t\u0019\u009CÕ\u0013lP)ä0P+Ç\u000EðÖÍ[H\u009B:\u008DÌPµú¦\u008D\u0098¨²\fÙ\u0089wíþ£t\u0014oV¬ Ö\u000F\u001E>\u0010\u0081\u008Ff^\f4\u00AD0û\u0012áô\u008Fæh¥KÙ\u0006[<Ä\u0006üðá£\u0092\u0007\u007F³a/^Üv?N§>ýÏ\u0082\u0096u\u0017Ã&\u0003µÊÚ\u0004ÇÀÇ\u0080g¨\u0096ô½7\u0081\u0091S)nØ®SÈrN\u0004Wæ\f+gjY\u009F)82ìÙ\u007F\u0085Bgs\u009DO¥ÒÃÌ`Ñì\u009A3ã¹sç²'£¹}\u008DêU\u0091\"E\n" +
                "Ä\u008B\u001B×\u001E\u001FÕ\u001Dvä\u001C\u0090tjg3Ïy÷í°ÙScI`Ísü\u0084\u00892\bgÜ¹³þÈ\u0093+'fÍ\u009E\u008B\u0003\u0087\u000E#}\u0086tðò\u008A\u0083ôiRKý³\u009E÷Lû1X.¼/\u000EüòçÎ\u008Dz¡3±T,q@Ä\u000EÛ\u0084xqm3\u001BüÍúMÁ\u0098\u0016*þçÎ#qâDÒ&Ñ¼®V\u00AD\u001A É\u001D\u0003óxÚðB\u0094K$\u000F÷,í\u0018\u0005E\u009A¦[g¿)¸Qç,\u00151´6áì\u001FÍßÙWþØ\u00AD+2fÌ\u0088\u0083\u0007\u000F\u0089%\u0002û&¶ÿ\f\u0095*Ùf·\n" +
                "\u0016(`\u007F_8{>mú\f\\½v\n" +
                "_~þ\u0099\u0098´\u000Eÿ{\u0004\u009A6n\u0088!ÃþB½ºï¢CÛoíåÈëÅ\u008F\u001F\u000FT^R\u0001É@Ómo//´kc3\u009BÝµk\u000FüýÏ;\u0098\u001AúÅ\u008D+3e\u001C\u0088.X´HÞy\u009AF\u009BÀ¾\u00853\u009EÑ\u0019<<=\u0091vá\"xZÌØ\u0083¦LÃÝ¡£ðpí\u0012\u0004{z\u008A\u00929Nº¼ðLíhiåÎ},[¶\u0002\u0015*\u0094ÃÑcÇÀç\u0093w(_^L\u009F5\u000B´dq\u000E4íÜ½o\u001F2g´)\u009593df\u008C)´-]8ÏÞ¶séJ\u0097N\u001DÑ¸i\u000BÜ»{\u0017\u001F6ú@¬O\u0098§\u009Fo\\4nÚ\\Æx\u009CÅ³\u0086\u0084\t\u0013Ùg\u008FL¼;³[\u0014Úk9\u0099¥¯]¿\u0001ÕÞª\u0082\u0014¡VheJ\u0097\u0002MÒyßT\u0006°_\u001B?~\"\n" +
                "\u0017)\u008C\u008D\u001B7á½:ï\"sæLrÜ\\{Ãæ-\u000E3\u0099G\u008F\u001E\u0095q\u000B\u008FÓ,>Ç«¯\u009A¤ É*ë5-³ªW¯\u0086%K\u0097Ë\f\u0018\u0013°íaÝ§Bõy\t|ß\f[\u009Am³¯ ÎYG\u001Ec \u0090Õ¿\u007F\u007F1ëîÑ£\u0087\bb<Ç\u001CwçYÜ\u00ADgäök\u009F\u009E¢@år\fN8äÌ\u00196\u0083_¹byÔ\n" +
                "5UåûÊ@\u00058-å\u0006\u000F\u0019*c\u009B\u009CÙ³að\u009F\u007F¡~p\bþ\u001A9\n" +
                "_~ö\u0089XÓ°\\M8rä\u0098Ý|\u0094q\u0094\u0013\u001E\u0084¶1|¶ÃG\u008F ¾\u000Bë:s¾;[*ggÌ\u009C\u0085/BÍÙ9>«T¡¼L\u008CÑúb×\u009E½È\u009F?\u009F\u0083²\u0096\u0016\u0012Í\u009B5}\"û8N\n" +
                "©\u0017\u00AD\u009E=ñ@\u0011DxSãB34\u0006ß8q¤\u0002rí\u0081ÑàÒÞwÄè±èÚ±=85ÌÆÞ9°!?yò4Æ\u008D\u009F\u0088Ï?µMá²³¡¦¿\\\u00992X³v-V¬Z\u008D~¿ô\u0091\u0017àä©Ó2\u009Bbòaa]¼x\u0001\u009FµúZ´\u0097\u001ChsÍW\u008B¦M0à\u008F!2ãÂ\u0001FáÂ\u0005ñZ~G3-\u0093Ç³n£ò\u0082yÜ¿¿¤{\u0080â¦q9\u008E 6u\u0011ü LëÍûñLà\u0005_\u008FÍaéâ\u001D\u0003n\u001EEHâ0\u009Bð¨Ü7;ä  G¸yó\u0096\u0098\u0090Ppt\u000Ell\u0093$~rfÖ\bô&=\u0085\u001E\u000E\f\u008CÐhâÙh\u009BÀYF\u000Eª¸æ´õW\u009F\u008Birç\u000Eí¤a¥\u0089,×+Pèàaá¢Å\u0098¿h1âÅõ\u0093\u0099ej\f¹Æ±Go\u009BC \"E\n" +
                "#Göl8tð\u0090¬\u0097áZ\u0016k8vâ\u0018úþö»D}×ú\u009B§6?°æ\u0019Ù¾«µB\u0091\u009Dc=Îçû¤e\u000B\u0004>z\u0084¤\u0089Âìì\u008B\u0017-j7Qd§5zôX9\u008Dû\u007F\u008F\u001AmÍBÖ!8Dp\u0016ÐÂ\u0086¦¦éÒ¥\u0013\n" +
                "2;Öå+VaÄð¡Ò\b³ÎrP=qÜhÌ\u0099;_fòwïÝ\u008BsçÎaóÖmøó\u000F\u009BÃ\u0099\u0019sæHãÇëPKlÖ³\u0098µ\u00014ó9zô¸ÌfÓÖ?\u00195\u0081ùÂL¯÷ìÛ'³\u008FÎ÷ùÔ¿G\u008C\u0003\n" +
                "\u0017Ú7\u0006~\u0099ü»\u000B(ù\u001A\u0090Þ¶V\u0017^\u001E@¢ä@\\\u001F`Qèz\u0082Öõ\u0080¢\u0005\u0001\u009Eûq\u0093\b/ÍÁPÿ\u0081\u0083Ñ¼iÄéL&\u009Cù£\u0092dÛ\u008E]hõù' ©¯\u0099Åà \u0090ë8\u0098§\u0099iäy=~î\u0085§u &?ë6^üøèóSØ\u001Ah®¹Üº}»5\u0089ìSAàj]ù·_µ\u0092ãË\u0096¯ÄG\u001F6\u0092}®C«\\©\"¼½¼1uz\u0098iÞ\u0013\u0099F5\"\u0086Ë\u0085õnð°?Ñ¯oo\u0099Måíq\u0080\u009F$iÒ'Öé\u009A[§\u0012àÓ/Z!cÆÌ\"4¶ïì¸\u000Eúß56Ó²o¿þBLì_Êr10ÂÙ>k;Æl¹T\u0084}DölÙ@s¬Q£ÇIÿÐ¦}GüÖ··\f¬¹\u001E\u009A\u0081Bú\u0080A\u00831 ßo2{S¦ô\u001B\u00986}¦\u001C\u000B\n" +
                "\t\u0081·E\u0088§²æ\u009DÚµ°rå*$I\u009CDf%~ø¹\u0097\fh?ü \u0081(\u0086¹¾uéò\u0015øóï\u0091hôA}1\u0013K\u009D*\u0015zôê-¦\u008DF9À\u000B,[õ/ö\u001E°-ý¸à\u007F\u0011ïÔ®)×å?£\u0080c{Éµ~)^I!\n" +
                "<\u000EX)ð2øXf¦í'>ãNò&\u001F;\b\u008Dw\u009BµDÀØ\u0091²ÎQ²\u000EåöðÜ>à\\Ô/ÆÁô¯ý\u0007\"®\u008F\u000F8\u00138xØpp¶\u0084ë®Ãó\u0098Y\u0084\u0016ý` IDAT¹bEQ\u0016^¹r\u0005ÛwîBÕP¡vÂ¤\u007Fì7Àþ\u0083K-&L\u009E\u0082n\u009D; O\u009E<6\u0013ÈÐ\u0014\u0095ß¬ \u0096\u0090\u0003\u0087þ)BbÕªUÄ?Å\u009E½®×Qr\\rüøI\u0019\u000Bð¾Ìzð+\u0097\u0003d9\f\u0095=¹ræDü\u0004ñå½ç \u009D\u0081\u00169\u009CY2Â\u001Aû \u008E]ºã÷_z¡ù'\u009FK\u007F\u00974YRìØ¾CÆ\u0097ì\u0003©ô63¯\\\u0092°vÍZd\n" +
                "\u0015\u0094\u001B7n(cÆ×C\u0015\u0004\u0001\u0001Wí\u0096\u001C¼\u001EÇHl\u0087\u008B\u0015+\n" +
                "Ö³\u001B7®\u008BÅ]èc?·\u001B\n" +
                "K|÷h\u008DGá\u0096ct\u008EÏ\u0018XÎ\u009C\u0091\u001F;v¬\u0094a\u009F>}Dø\u0089Ê¸ÖÝzÆ{Xºt\u0099Ì$ÒÒ¡Ï¯¿cÜè0¹ÀÇ×ï\t_\n" +
                ",÷©ÓgÊ8bÖÜy26¬P¦´]¶8\u007Fá\"è\u009B¡m¨\u0082\u009D3È´LÉþjVlÚ´\u0005¬{T\u0019?\u000B7nÞDþ¼y\u009E\u0018¿Fµð8AQûíZ¸ví\u009A\u009CÊÙZÎ²3dÊ\u0098\u0011oU®ä°ô\u0088íGò\u0014¯`Ü$Ç\t\u001B9Á\u0083Ö\faÖ?/j=\u0093g\u0089ä\u009F7\u001Ddp\u008D\u0016\u0007µ®\u0002Í\u0002úöì!\n" +
                "ÇW_|î*\u0089Ä±\u00830öÕ\u008C`'ÄÆ`ô¸\tx5KfL\u0018;J´\u008FÔ\u001EÒÞü×>½ì\u0095\u008B\u000Bé©qîöãÏ¢]¢v²ß/½Å¤$]Út²Þ\u0091\u000Bïisÿ\\\u0084#\u007F\u0003´\f\\ÿÐÞ[yï\u0099\u0083\u0007G\u001DíÉ}^õ\u0004èOÄó!Àµ¤%Cÿù@âo\u009Fú1Ø8_´83qÎ\u0088/\u0093+SÕ#G\u008F9$eÃiÕ¼r\u009AÞ8Iá:I«Ó\u0002j\u0095Øé³¡J\u001AÚØsK\u0093b\u000EºS§J)\u001A\u0099÷ë¼#\u009A\u0098)Ó¦\u008B@Ã\u0086.®\u008FM\u0098\u0016Ç;\u0089\u0012I¼³\u0003\u0018ÞXî\u009C¹ðS$Îq\u001C\u001Eà9øÁ\u008E°ßÀÁ¸yã¦h\u008F\u009E8\u0081\u0096Í\u009A\u0082B95æ\f4\u008B4\u0081k|Ú\u007F×\u0006\u009D¿ï.ë\u0013Ø¨\u008F\u00183æ\t\u00AD`þ<yÑ´\u0089ÍÓ+\u009D\u0014Ðá\u0091¬ù\n" +
                "\tFý÷ëJ§ÇÁ\u0014Í:(è³Áå\"\u007F\n" +
                "\u0091´Íç{HÁÑUX¿q\u0013nÝ¸\t¯8ÞøêËÏ¥1¦)\u0010\u001Bl:Zâ\u008C0\u0007óû\u000E\u001E\u0004\u0005\u0014Þ#g«i\u008ER«fuû\u0080ßUÞnÇÍY\u0006´ì\u0007ôn\u000Eôù\u0012\u00183\u000F\u0018ºø¢\u0006pî\u0002àç\u0003|R\u0015\u0018½\bÈ\u0092\u0006hQ\u001Bðö\u0002\u008A4\u0007ªæ\u0088TpdýêÚ©£¬\u0093pç\u009Eè\u0090¦IãFv\u0013,\u007F\u007F\u007FQb\u001C>z\u0014åK\u0097\u0006gß©¡¶\u0086vß}+3\u0093\u008Cã{Ã¶ë\u008F\u0001ýàí40u\u009E\u0007£BÍha\u00ADùE6ÃNS~ÿÐ\u0099\u0097\u0003ûö\u008Bàh=?Zöc¸\\Î_8\u008FO[4\u0097~\u0080¦U\fÔ\u009AsÆ×üf\u001Cë±}@\u001C\u0002Ô¨V\n" +
                "_|ö\u0089[\u008FøR\u0096\u008B[Oþì\u0089Ø·på¼¶ÖUÎì\u0097Yfgüýe\u009DY§\u000Eí$Ùâ%K¥_0\u0016\u000E¦^ÓL\u0095k¬\u0017/Y\u0086W3g\u0016%Ì±cÇÁ?\u0006\u009F8>øñû.¢´âo¾\u0093={ü\u0080\u009D;v\u008A\u0005\u008D1\u008F¬ÿ^\u001DûúÄí;vÊ¹æ\u001F×ûÑùU\u0096Ì\u0099ðç\u0088\u0011hõÙ§H\u0093&\n" +
                "~ù}Fÿõ§I\u0016í[¿o¾°ç\u0019rì8®\u008E\u001Diÿ\u001D\u001D;\\\u0006Tã\u00AD*Ò&uíÒ\t\u00AD[}\u0081ÆÍZàû\u008E¶µù\u0011]\u0083e)\u008C-³¡&=\u0005*\u008E\u007Fúá{1\u0007\u009D2}\u0016¼\u009C¾ìMáû§n]DÀäÒ\u0018\n" +
                ",)S¤\u0080\u008F¯¯]Ð#ë÷ëÔAöìÙeíþ\u0081\u0083\u0087ì\u00167¼\u0016û\u001A\n" +
                "\u0085¾¾6eñ\u00993gÀÙ\u00ADÖß|e\u009Fa6÷Ä-ý\u00044iÜ@¬\u008E¨\u0004mß©\u000B\u001A5¨/ËdÖ®[/&\u008Eô¿@§`¹såÂ\u0082ù6³AZ \føc¨\u0098KoÙ¾C\u00966q\u0016èð±cr\u001D.¿¢)/-J\u0016/[\u0086·ß®)Jî]{÷¡Õ3:X±Þ\u007FtïS8d?Ì>\u0088\u0016`S§M\u0093K°ìx\u008C}Ê\u0086\n" +
                "\u001BÐ³gO±Ö\u009A3g\u008E\u0098«r\tNT\u0004Ç¨Ô³\f\u00193Ê\u0098\u0084\n" +
                "Õ´éÒÈ\u0092\u0012\u008EûÎ_¼\u00883§O#Nè'´(\u0094qìÇqE¦\u008C\u0019D\tþðþ\u0003´ïÜ\u0015ïÔª\u0089_zý$Ö>\u009C\u0011§Ò\u008Af®µkÕ\u0014\u000BCz\u0084ýâÓ\u00968|ä\b¸\u000E÷ÌÙ³¸\u001C\u0010 V;×o\\Ç¹ó\u0017Ä²íÃF\n" +
                "ÁYö\u001E=û¸\u0085¾{×Î2cÍ5³wïÝGÎlYq?t&\u0093cÚùNf¨T|1p¦\u009Fm^ÑB¶¥?®.Fç@lçØþ½hõÌÕó\u0084\u0017çÍ\u0005È,\u0010¾`\u000B\u0017/\u0091\u0085\u00AD;vìÀþ}6\u00AD\u001E\u001B\u0017VLÎJlÙ²5¼|ðé'\u001FK¥6\tfÌ\u009A\u008D\u0081\u007FØ\u001CyT*_\u000Eí;uE<?_ÑüÑäõï\u0011£ðí7_ÙL\u0012CB0nü\u0004Ô¬^U\u0006¼\u00992d@\u001Cï8b¦Ç\u0019FÎDN\u009B<A\u0084J\u0093ÿÿu{é_\u0080\u008A\u0085×è\u0089\u0081\u0082!§e\u0085b~\u009FÌ\u0003ð\f±YÚ\u0015\f\u0001Øn\u009E\u0018\u000Bä\u0089\u009AàÈ\n" +
                "h\u0002+®\u0099\n" +
                "1qÖí\u0082EK\u0090(á\u0093ÎqvîÜã`ªÊY\u0014\u009A&q]\u0001\u0003\u001B\n" +
                "jjù\u0002Ó\u0014Â*8ZówµÏÆ\u0083\u008B\u0097¹¸Ø\u0004¾\u0088ô®E-ØË\u001Ah\u0087Ï\u0001\t\u001B-\n" +
                "x\\;H\u0013m®Ñ wA\u0006\u009AÚ\u0018¯³Y…\"";
        byte[] bytes = s6.getBytes();
        System.out.println(Arrays.toString(bytes));
        OutputStream outputStream = new FileOutputStream(new File("./test.png"));
        outputStream.write(bytes, 0, bytes.length);
    }
}